
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

18-user 8-core Stata network perpetual license:
       Serial number:  501606203534
         Licensed to:  National Bureau of Economic Research
                       Cambridge, MA 02138

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running /disk/admin/Linux-7-local/stata16/sysprofile.do ...

. do 1.1_prep_UKB_phenos.do 

. clear all

. cd "/disk/genetics4/PGS/Aysu/PGS_Repo_pipeline/derived_data/1_UKB_GWAS"
/disk/genetics4/PGS/Aysu/PGS_Repo_pipeline/derived_data/1_UKB_GWAS

. local crosswalk="/disk/genetics2/ukb/orig/UKBv2/linking/ukb_imp_v2.ukb1142_im
> p_chr1_v2_s487398.crosswalk"

. local partition_data="/disk/genetics4/PGS/Aysu/PGS_Repo_pipeline/derived_data
> /1_UKB_GWAS/tmp/IDs_assignPartition_ordered.txt"

. local pheno_data_1="/disk/genetics2/ukb/orig/UKBv2/pheno/9690_update/ukb9690_
> update_jun14_2018.dta"

. local covar_data="/disk/genetics2/ukb/orig/UKBv2/linking/ukb_sqc_v2_combined_
> header.dta"

. local pheno_data_2="/disk/genetics2/ukb/orig/UKBv2/pheno/22392/ukb22392.dta"

. local pheno_data_3="/disk/genetics/ukb/data/41490_alc_cannabis_menarche_myopi
> a/ukb41490.dta"

. 
. log using "/disk/genetics4/PGS/Aysu/PGS_Repo_pipeline/code/1_UKB_GWAS/1.1_pre
> p_UKB_phenos.do.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /disk/genetics4/PGS/Aysu/PGS_Repo_pipeline/code/1_UKB_GWAS/1.1_pre
> p_UKB_phenos.do.log
  log type:  text
 opened on:   1 May 2020, 12:32:29

. display "$S_DATE $S_TIME"
 1 May 2020 12:32:29

. 
. 
. 
. ******************************************************
. **                 PREPARE PHENOTYPES UKB           **
. **                  PGS Repo project                **
. **                                                  **
. **                Casper Burik 12 Feb 2018          **
. **              Last edit Casper: 22 Feb 2020       **
. **              Last edit Aysu: 14 April 2020        **
. ******************************************************
. 
. ** Get phenotypes: Eczema?, 22126 (for hayfever), 22127 (for asthma), n_22040
>  // MET minutes per week
. 
. 
. set more off

. set maxvar 32000


. 
. 
. use `pheno_data_1'

. 
. keep n_50_* ///  Height 
>     n_23104_* /// BMI
>     n_20127_0_0 /// Neuroticism scoreplot
>     n_1180_* /// Morning person
>     n_6160* /// Religious group activity
>     n_4526*  /// Happiness / Subjective Wellbeing
>     n_20160* /// Ever smoked
>     n_2178* /// Self-rated Health
>     n_2754* /// Age at First birth
>     n_2734* /// Number of children (women)
>     n_2405* /// Number of children (men)
>     n_6152* /// Other diagnoses (Hayfever)
>     s_41202_* s_41204_* /// ICD10
>     n_20002_* /// Non-cancer illness
>     n_20107_* /// Father's illnesses
>     n_20110_* /// Mother's illnesses
>     n_1807_* /// Father's age at death
>     n_3526_* /// Mother's age at death
>     n_2946_* /// Father's age
>     n_1845_* /// Mother's age
>     /// n_3872* /// Age at First birth single child
>     /// 20403_0_0  /// Amount of alcohol drunk on a typical drinking day
>     /// 20405_0_0  /// Ever had known person concerned about, or recommend re
> duction of, alcohol consumption
>     /// 20407_0_0  /// Frequency of failure to fulfil normal expectations due
>  to drinking alcohol in last year
>     /// 20408_0_0  /// Frequency of memory loss due to drinking alcohol in la
> st year
>     /// 20409_0_0  /// Frequency of feeling guilt or remorse after drinking a
> lcohol in last year
>     /// 20411_0_0  /// Ever been injured or injured someone else through drin
> king alcohol
>     /// 20412_0_0  /// Frequency of needing morning drink of alcohol after he
> avy drinking session in last year
>     /// 20413_0_0  /// Frequency of inability to cease drinking in last year
>     /// 20414_0_0  /// Frequency of drinking alcohol
>     /// 20416_0_0  /// Frequency of consuming six or more units of alcohol
>     n_4559_* /// Family satisfaction
>     n_4570_* /// Friendship satisfaction
>     n_4537_* /// Work satisfaction
>     n_4581_* /// Financial satisfaction
>     n_2020_* /// loneliness
>     n_3456_* n_2887_* n_6183_* /// Cigarettes per day
>     n_19?0_* ///
>     n_2000_* ///
>     n_2010_* ///
>     n_2020_* ///
>     n_2030_* ///
>     n_1558_* /// drinking frequency
>     n_1568_* /// red wine per week
>     n_1578_* /// white wine and champagne
>     n_1588_* /// beer and cider per week
>     n_1598_* /// spirits per week
>     n_1608_* /// fortified wine per week
>     n_5364_* /// other alcoholic drinks per week LESS PEOPLE
>     n_4407_* /// red wine per month
>     n_4418_* /// white and champagne
>     n_4429_* /// beer
>     n_4440_* /// spirits
>     n_4451_* /// fortified wine
>     n_4462_* /// other
>     n_20117_* /// EVERDRINK status (derived)
>     n_1239_* /// current smoking
>     n_1249_* /// past smoking
>     n_2644_* /// light smoking
>     n_6138_* /// EA
>     n_20016_* /// IQ touchscreen
>     n_20191_* /// IQ web-based
>     n_2040_* /// Risk
>     n_21000_* /// // Ethnicity
>     n_21003_* /// age at assesment visit
>     n_34_0_0 n_22200_0_0 /// birth year
>     n_22010_* /// // Bad genotype n_22027_0_0
>     n_eid // ID

. 
. gen IID=n_eid

. merge 1:1 IID using `covar_data', nogen keep(match) 
(note: variable IID was float, now double to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           488,349  
    -----------------------------------------

. merge 1:1 n_eid using `pheno_data_2', nogen keep(match)
(label m_100586 already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           488,349  
    -----------------------------------------

. merge 1:1 n_eid using `pheno_data_3', nogen keep(match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           488,263  
    -----------------------------------------

. 
. *** DROP OBSERVATIONS ***
. // Withdrawn individuals:
. foreach id in 1038534 1048252 1085993 1136386 1138937 1142637 1154859 1262850
>  1283111 1283616 ///
>     1300553 1364378 1370374 1371898 1378890 1405916 1425122 1431973 1437530 1
> 451103 1481466 ///
>     1533928 1535412 1548599 1560258 1560429 1604306 1626372 1750924 1799527 1
> 872177 1890503 ///
>     1977732 2002238 2040924 2099267 2119447 2165727 2238632 2242976 2323750 2
> 332131 2472313 ///
>     2474972 2512665 2518039 2586585 2679822 2687632 2702195 2723486 2784782 2
> 791953 2793515 ///
>     2796360 2947991 2994818 3091905 3098976 3157343 3162399 3178848 3199605 3
> 258519 3314334 ///
>     3373335 3393798 3403770 3447432 3466177 3553318 3563210 3580955 3590961 3
> 623224 3639236 ///
>     3641934 3656893 3672665 3675369 3739874 3789586 3877018 3880771 3931774 3
> 939246 3962080 ///
>     3964248 3975476 4012699 4025282 4070440 4084812 4155673 4170030 4183522 4
> 337448 4405797 ///
>     4419037 4598042 4693228 4701857 4732737 4819063 4823640 4884464 4893886 4
> 962254 4980287 ///
>     4992864 5070668 5087142 5106856 5137728 5205453 5211729 5225718 5266776 5
> 267820 5291977 ///
>     5305498 5312601 5344717 5356287 5368810 5369682 5388606 5401275 5416501 5
> 417891 5464094 ///
>     5487522 5554364 5569334 5571224 5654288 5689279 5697575 5702369 5730419 5
> 750297 5762972 ///
>     5770853 5801079 5878770 5914593 5950775 5958708 6008079{
  2.         drop if n_eid == `id'
  3.     }
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)

. 
. 
. *** QC ***
. ren Sex SEX

. 
. * Undefined sex
. drop if SEX == 0 
(0 observations deleted)

. drop if missing(SEX)
(0 observations deleted)

. 
. ren Batch BATCH

. drop if missing(BATCH)
(0 observations deleted)

. drop if InferredGender != SubmittedGender
(378 observations deleted)

. 
. * Bad genotypes, initial release
. drop if n_22010_0_0 == 1 
(468 observations deleted)

. * Bad genotypes, second release
. drop if hetmissingoutliers == 1
(873 observations deleted)

. drop if missing(PC1-PC40)
(0 observations deleted)

. drop if n_eid < 0 
(0 observations deleted)

. drop if putativesexchromosomeaneuploidy == 1
(470 observations deleted)

. 
. * Non-Europeans
. drop if PC1 > 0 
(38,157 observations deleted)

. 
. *** Create ETHN  ***
. gen ETHN =  n_21000_0_0
(230 missing values generated)

.     replace ETHN = n_21000_1_0 if missing(ETHN)
(3 real changes made)

.     replace ETHN = n_21000_2_0 if missing(ETHN)
(2 real changes made)

.     drop if missing(ETHN)
(225 observations deleted)

.     ** Keep White (value = 1) / British (value = 1001) / Irish (value = 1002)
>  / Any other white background (value = 1003)
.     drop if (ETHN != 1 & ETHN != 1001 & ETHN != 1002 & ETHN != 1003)
(1,707 observations deleted)

. 
. *** Create BYEAR ***
. gen BYEAR = (n_34_0_0 - 1900)/10

.     replace BYEAR = (n_22200_0_0 - 1900)/10 if missing(BYEAR)
(0 real changes made)

.     drop if missing(BYEAR)
(0 observations deleted)

. 
. forval i = 0/2 {
  2.     gen AGE`i'=n_21003_`i'_0
  3.     gen AGE`i'sq=AGE`i'*AGE`i'
  4.     gen AGE`i'cb=AGE`i'*AGE`i'*AGE`i'
  5. }
(427,091 missing values generated)
(427,091 missing values generated)
(427,091 missing values generated)
(426,242 missing values generated)
(426,242 missing values generated)
(426,242 missing values generated)

. 
. *****************************************************************************
> *****
. ******************************* GENERATE VARS *******************************
> *****
. *****************************************************************************
> *****
. 
. **********************************************************
. ********************** ALZHEIMER'S  **********************
. **********************************************************
. * Father's ALZ status
. 
. foreach i in 0 1 2{
  2.     gen ALZF_`i'=0 if n_20107_`i'_0!=.
  3.     forval j = 0/3{
  4.         replace ALZF_`i'=1 if n_20107_`i'_`j'==10 
  5.     }
  6. }
(11,545 missing values generated)
(14,869 real changes made)
(3,397 real changes made)
(287 real changes made)
(8 real changes made)
(427,188 missing values generated)
(1,126 real changes made)
(266 real changes made)
(19 real changes made)
(0 real changes made)
(424,746 missing values generated)
(1,652 real changes made)
(199 real changes made)
(13 real changes made)
(1 real change made)

. 
. 
. foreach i in 0 1 2{
  2.     forval j = 0/3{
  3.         replace ALZF_`i'=. if ALZF_`i'==0 & (n_20107_`i'_`j'==-11 | n_2010
> 7_`i'_`j'==-13)
  4.     }
  5. }
(23,851 real changes made, 23,851 to missing)
(5,184 real changes made, 5,184 to missing)
(285 real changes made, 285 to missing)
(23 real changes made, 23 to missing)
(853 real changes made, 853 to missing)
(212 real changes made, 212 to missing)
(14 real changes made, 14 to missing)
(0 real changes made)
(1,217 real changes made, 1,217 to missing)
(125 real changes made, 125 to missing)
(11 real changes made, 11 to missing)
(1 real change made, 1 to missing)

. 
. egen ALZF=rmax(ALZF_*)
(39906 missing values generated)

. 
. foreach i in 0 1 2{
  2.    gen F_age_`i'= n_2946_`i'_0 if n_2946_`i'_0>0
  3.    replace F_age_`i' = n_1807_`i'_0 if F_age_`i'==. & n_1807_`i'_0>0
  4. }
(346,859 missing values generated)
(329,501 real changes made)
(443,103 missing values generated)
(15,768 real changes made)
(442,796 missing values generated)
(17,921 real changes made)

. 
. egen F_age=rmax(F_age_*) if ALZF==0
(63861 missing values generated)

. replace F_age=F_age_0 if ALZF_0==1
(18,394 real changes made)

. replace F_age=F_age_1 if ALZF_0==0 & ALZF_1==1
(627 real changes made)

. replace F_age=F_age_2 if ALZF_0==0 & ALZF_1==0 & ALZF_2==1
(91 real changes made)

. 
. * Set to ALZF missing if father's ALZ status is 0 but father dies before age 
> 60 or if father is younger than 60
. replace ALZF=. if ALZF==0 & F_age<60
(53,146 real changes made, 53,146 to missing)

. 
. * Set to missing if father's age is not known
. replace ALZF=. if F_age==.
(4,843 real changes made, 4,843 to missing)

. 
. **************************
. 
. * Mother's ALZ status
. foreach i in 0 1 2{
  2.     gen ALZM_`i'=0 if n_20110_`i'_0!=.
  3.     forval j = 0/2{
  4.         replace ALZM_`i'=1 if n_20110_`i'_`j'==10 
  5.     }
  6. }
(7,184 missing values generated)
(31,265 real changes made)
(4,050 real changes made)
(111 real changes made)
(427,045 missing values generated)
(2,502 real changes made)
(293 real changes made)
(5 real changes made)
(424,638 missing values generated)
(3,236 real changes made)
(208 real changes made)
(7 real changes made)

. 
. foreach i in 0 1 2{
  2.     forval j = 0/2{
  3.         replace ALZM_`i'=. if ALZM_`i'==0 & (n_20110_`i'_`j'==-11 | n_2011
> 0_`i'_`j'==-13)
  4.     }
  5. }
(13,577 real changes made, 13,577 to missing)
(3,640 real changes made, 3,640 to missing)
(254 real changes made, 254 to missing)
(460 real changes made, 460 to missing)
(137 real changes made, 137 to missing)
(10 real changes made, 10 to missing)
(622 real changes made, 622 to missing)
(93 real changes made, 93 to missing)
(8 real changes made, 8 to missing)

. 
. egen ALZM=rmax(ALZM_*)
(23956 missing values generated)

. 
. foreach i in 0 1 2{
  2.    gen M_age_`i'= n_1845_`i'_0 if n_1845_`i'_0>0
  3.    replace M_age_`i' = n_3526_`i'_0 if M_age_`i'==. & n_3526_`i'_0>0
  4. }
(273,326 missing values generated)
(264,337 real changes made)
(440,550 missing values generated)
(13,507 real changes made)
(439,985 missing values generated)
(15,426 real changes made)

. 
. egen M_age=rmax(M_age_*) if ALZM==0
(66026 missing values generated)

. replace M_age=M_age_0 if ALZM_0==1
(35,170 real changes made)

. replace M_age=M_age_1 if ALZM_0==0 & ALZM_1==1
(1,319 real changes made)

. replace M_age=M_age_2 if ALZM_0==0 & ALZM_1==0 & ALZM_2==1
(196 real changes made)

. 
. * Set ALZM to missing if mother's ALZ status is 0 but mother dies before age 
> 60 or if mother is younger than 60
. replace ALZM=. if ALZM==0 & M_age<60
(30,658 real changes made, 30,658 to missing)

. 
. * Set to missing if father's age is not known
. replace ALZM=. if M_age==.
(5,385 real changes made, 5,385 to missing)

. 
. **********************************************************
. 
. **********************************************************
. ************************ MENARCHE  ***********************
. **********************************************************
. forval i=0/3{
  2.     replace n_2714_`i'_0=. if n_2714_`i'_0<0    
  3. }
(6,694 real changes made, 6,694 to missing)
(267 real changes made, 267 to missing)
(651 real changes made, 651 to missing)
(36 real changes made, 36 to missing)

. egen MENARCHE=rmean(n_2714_*)
(210339 missing values generated)

. 
. **********************************************************
. 
. 
. 
. **********************************************************
. ************************* MYOPIA  ************************
. **********************************************************
. 
. forval i=0/3{
  2.     gen MYOPIA`i'=.
  3.     replace MYOPIA`i'=0 if n_2207_`i'_0==0 | (n_6147_`i'_0!=. & n_6147_`i'
> _0>1)
  4.     replace MYOPIA`i'=1 if n_6147_`i'_0==1
  5. }
(445,985 missing values generated)
(100,985 real changes made)
(35,554 real changes made)
(445,985 missing values generated)
(11,514 real changes made)
(7,430 real changes made)
(445,985 missing values generated)
(26,250 real changes made)
(17,504 real changes made)
(445,985 missing values generated)
(1,718 real changes made)
(1,112 real changes made)

. egen MYOPIA=rmax(MYOPIA*)
(271524 missing values generated)

. 
. replace MYOPIA=0 if MYOPIA==. & n_20262_0_0==0
(1,305 real changes made)

. replace MYOPIA=1 if n_20262_0_0==1 | n_20262_0_0==2
(4,164 real changes made)

.   
. **********************************************************
. 
. **********************************************************
. ******************* CANNABIS AMOUNT **********************
. **********************************************************
. ren n_20453_0_0 CANNABIS

. replace CANNABIS=. if CANNABIS<0
(198 real changes made, 198 to missing)

. **********************************************************
. 
. 
. **********************************************************
. ******************** EVER CANNABIS  **********************
. **********************************************************
. gen EVERCANNABIS=0 if CANNABIS==0
(333,010 missing values generated)

. replace EVERCANNABIS=1 if CANNABIS!=. & CANNABIS>0
(31,137 real changes made)

. **********************************************************
. 
. 
. **********************************************************
. *************************** AUDIT  ***********************
. **********************************************************
. foreach i in 403 405 407 408 409 411 412 413 414 416 {
  2.     replace n_20`i'_0_0=. if n_20`i'_0_0<0
  3. }
(462 real changes made, 462 to missing)
(211 real changes made, 211 to missing)
(64 real changes made, 64 to missing)
(96 real changes made, 96 to missing)
(122 real changes made, 122 to missing)
(78 real changes made, 78 to missing)
(11 real changes made, 11 to missing)
(168 real changes made, 168 to missing)
(179 real changes made, 179 to missing)
(196 real changes made, 196 to missing)

. 
. 
. foreach i in 403 407 408 409 412 413 416{
  2.     replace n_20`i'_0_0 = n_20`i'_0_0 - 1
  3. }
(132,216 real changes made)
(79,555 real changes made)
(79,523 real changes made)
(79,497 real changes made)
(79,608 real changes made)
(79,451 real changes made)
(132,482 real changes made)

. 
. foreach i in 405 411{
  2.     replace n_20`i'_0_0 = 2*n_20`i'_0_0
  3. }
(12,581 real changes made)
(6,175 real changes made)

. 
. egen AUDIT=rowtotal(n_20403_0_0 n_20405_0_0 n_20407_0_0 n_20408_0_0 n_20409_0
> _0 n_20411_0_0 n_20412_0_0 n_20413_0_0 n_20414_0_0 n_20416_0_0)

. 
. replace AUDIT=. if n_20414_0_0==.
(301,854 real changes made, 301,854 to missing)

. replace AUDIT=. if n_20414_0_0==0 & (n_20405_0_0==. | n_20411_0_0==.)
(27 real changes made, 27 to missing)

. replace AUDIT=. if n_20403_0_0 + n_20416_0_0>0 & (n_20407_0_0==. | n_20408_0_
> 0==. | n_20409_0_0==. | n_20412_0_0==. | n_20413_0_0==. | n_20405_0_0==. | n_
> 20411_0_0==.)
(12,444 real changes made, 12,444 to missing)

. gen logAUDIT=log10(AUDIT)
(314,325 missing values generated)

. 
. 
. **********************************************************
. ************************ EA ******************************
. **********************************************************
. forval i = 0/1 {
  2.     forval j = 0/5 {
  3.         g EA_`i'_`j' = 20 if n_6138_0_0 == 1
  4.         replace EA_`i'_`j' = 13 if n_6138_`i'_`j' == 2
  5.         replace EA_`i'_`j' = 10 if n_6138_`i'_`j' == 3
  6.         replace EA_`i'_`j' = 10 if n_6138_`i'_`j' == 4
  7.         replace EA_`i'_`j' = 19 if n_6138_`i'_`j' == 5
  8.         replace EA_`i'_`j' = 15 if n_6138_`i'_`j' == 6
  9.         replace EA_`i'_`j' = 7 if n_6138_`i'_`j' == -7
 10.         replace EA_`i'_`j' = . if n_6138_`i'_`j' == -3
 11.     }
 12. }
(305,176 missing values generated)
(50,309 real changes made)
(96,500 real changes made)
(24,108 real changes made)
(29,494 real changes made)
(22,962 real changes made)
(77,512 real changes made)
(0 real changes made)
(305,176 missing values generated)
(68,585 real changes made)
(43,773 real changes made)
(18,086 real changes made)
(25,157 real changes made)
(33,015 real changes made)
(0 real changes made)
(0 real changes made)
(305,176 missing values generated)
(0 real changes made)
(65,853 real changes made)
(8,774 real changes made)
(17,199 real changes made)
(22,345 real changes made)
(0 real changes made)
(0 real changes made)
(305,176 missing values generated)
(0 real changes made)
(0 real changes made)
(7,290 real changes made)
(8,991 real changes made)
(39,945 real changes made)
(0 real changes made)
(0 real changes made)
(305,176 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1,740 real changes made)
(7,491 real changes made)
(0 real changes made)
(0 real changes made)
(305,176 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(983 real changes made)
(0 real changes made)
(0 real changes made)
(305,176 missing values generated)
(2,381 real changes made)
(3,818 real changes made)
(621 real changes made)
(1,217 real changes made)
(1,013 real changes made)
(1,644 real changes made)
(1 real change made, 1 to missing)
(305,176 missing values generated)
(4,492 real changes made)
(2,128 real changes made)
(663 real changes made)
(1,129 real changes made)
(1,602 real changes made)
(0 real changes made)
(0 real changes made)
(305,176 missing values generated)
(0 real changes made)
(4,365 real changes made)
(405 real changes made)
(840 real changes made)
(1,195 real changes made)
(0 real changes made)
(0 real changes made)
(305,176 missing values generated)
(0 real changes made)
(0 real changes made)
(444 real changes made)
(609 real changes made)
(2,728 real changes made)
(0 real changes made)
(0 real changes made)
(305,176 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(111 real changes made)
(534 real changes made)
(0 real changes made)
(0 real changes made)
(305,176 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(66 real changes made)
(0 real changes made)
(0 real changes made)

. 
. *** Take max ***
. egen EA = rmax(EA_*_*)
(3896 missing values generated)

. **********************************************************
. 
. 
. **********************************************************
. ************************ IQ ******************************
. **********************************************************
. 
. forval i = 0/2 {
  2.     qui xi: reg n_20016_`i'_0 SEX##c.AGE`i' SEX##c.AGE`i'sq SEX##c.AGE`i'c
> b
  3.     predict IQtouch`i',rstandard
  4. }
(302,700 missing values generated)
(427,270 missing values generated)
(428,100 missing values generated)

. 
. qui xi: reg n_20191_0_0 SEX##c.AGE0 SEX##c.AGE0sq SEX##c.AGE0cb

. predict IQweb, rstandard
(332,511 missing values generated)

. 
. egen IQ = rmean (IQtouch* IQweb)
(220929 missing values generated)

. **********************************************************
. 
. 
. 
. **********************************************************
. ************************ RISK ****************************
. **********************************************************
. forval i = 0/2 {
  2.     qui xi: reg n_2040_`i'_0 SEX##c.AGE`i' SEX##c.AGE`i'sq SEX##c.AGE`i'cb
  3.     predict risk_`i', rstandard 
  4. }
(6 missing values generated)
(427,099 missing values generated)
(426,379 missing values generated)

. 
. egen RISK=rmean(risk_*)
(1 missing value generated)

. 
. **********************************************************
. 
. 
. 
. **********************************************************
. ************************ HEIGHT **************************
. **********************************************************
. forval i = 0/2 {
  2.     qui xi: reg n_50_`i'_0 SEX##c.AGE`i' SEX##c.AGE`i'sq SEX##c.AGE`i'cb
  3.     predict height_`i', rstandard 
  4. }
(968 missing values generated)
(427,115 missing values generated)
(426,678 missing values generated)

. 
. egen HEIGHT=rmean(height_*)
(931 missing values generated)

. **********************************************************
. 
. 
. **********************************************************
. ************************* BMI ****************************
. **********************************************************
. forval i = 0/1 {
  2.     qui xi: reg n_23104_`i'_0 SEX##c.AGE`i' SEX##c.AGE`i'sq SEX##c.AGE`i'c
> b
  3.     predict bmi_`i', rstandard 
  4. }
(7,757 missing values generated)
(427,366 missing values generated)

. egen BMI = rmean(bmi_*)
(7509 missing values generated)

. **********************************************************
. 
. 
. **********************************************************
. ********************* NEUROTICISM ************************
. **********************************************************
. qui xi: reg n_20127_0_0 SEX##c.AGE0 SEX##c.AGE0sq SEX##c.AGE0cb

. predict NEURO, rstandard
(84,297 missing values generated)

. **********************************************************
. 
. 
. **********************************************************
. ********************* MORNING PERSON *********************
. **********************************************************
. * scale 1-4, was reverse coded
. forval i = 0/2 {
  2.     gen morning_`i' =  5 - n_1180_`i'_0 if n_1180_`i'_0!=. & n_1180_`i'_0 
> > 0
  3.     qui xi: reg morning_`i' SEX##c.AGE`i' SEX##c.AGE`i'sq SEX##c.AGE`i'cb
  4.     predict MORNING_`i', rstandard
  5. }
(47,359 missing values generated)
(47,359 missing values generated)
(428,762 missing values generated)
(429,049 missing values generated)
(426,288 missing values generated)
(428,164 missing values generated)

. egen MORNING = rmean(MORNING_*)
(44909 missing values generated)

. **********************************************************
. 
. 
. **********************************************************
. *********************** RELIGIOSITY **********************
. **********************************************************
. forval i = 0/2 {
  2.     gen relig_`i' = 0 if (n_6160_`i'_0 != -3 & !missing(n_6160_`i'_0))
  3.     forval j = 0/4 {
  4.         replace relig_`i' = 1 if n_6160_`i'_`j' == 3
  5.     }
  6.     qui xi: reg relig_`i' SEX##c.AGE`i' SEX##c.AGE`i'sq SEX##c.AGE`i'cb
  7.     predict RELIG_`i', rstandard
  8. }
(1,189 missing values generated)
(39,258 real changes made)
(22,432 real changes made)
(3,655 real changes made)
(0 real changes made)
(0 real changes made)
(1,189 missing values generated)
(426,794 missing values generated)
(1,999 real changes made)
(1,283 real changes made)
(218 real changes made)
(0 real changes made)
(0 real changes made)
(427,119 missing values generated)
(424,334 missing values generated)
(1,783 real changes made)
(1,258 real changes made)
(237 real changes made)
(0 real changes made)
(0 real changes made)
(426,393 missing values generated)

. 
. egen RELIG = rmean(RELIG_*)
(1143 missing values generated)

. **********************************************************
. 
. 
. **********************************************************
. *************************** SWB **************************
. **********************************************************
. * scale 1-6, was reverse coded
. forval i = 0/2 {
  2.     gen swb_`i' = 7 - n_4526_`i'_0 if n_4526_`i'_0 > 0 
  3.     qui xi: reg swb_`i' SEX##c.AGE`i' SEX##c.AGE`i'sq SEX##c.AGE`i'cb
  4.     predict SWB_`i', rstandard
  5. }
(299,704 missing values generated)
(299,704 missing values generated)
(426,833 missing values generated)
(427,158 missing values generated)
(424,374 missing values generated)
(426,431 missing values generated)

. 
. egen SWB = rmean(SWB_*)
(276766 missing values generated)

. **********************************************************
. 
. *rerun
. **********************************************************
. *********************** DEPRESSION ***********************
. **********************************************************
. * replace 'do not knows'
. forval i=2/9 {
  2.     replace n_19`i'0_0_0 = . if n_19`i'0_0_0 < 0
  3.     replace n_19`i'0_1_0 = . if n_19`i'0_1_0 < 0
  4.     replace n_19`i'0_2_0 = . if n_19`i'0_2_0 < 0
  5. }
(10,446 real changes made, 10,446 to missing)
(351 real changes made, 351 to missing)
(371 real changes made, 371 to missing)
(7,271 real changes made, 7,271 to missing)
(245 real changes made, 245 to missing)
(273 real changes made, 273 to missing)
(19,476 real changes made, 19,476 to missing)
(793 real changes made, 793 to missing)
(824 real changes made, 824 to missing)
(12,575 real changes made, 12,575 to missing)
(523 real changes made, 523 to missing)
(591 real changes made, 591 to missing)
(9,031 real changes made, 9,031 to missing)
(324 real changes made, 324 to missing)
(372 real changes made, 372 to missing)
(11,391 real changes made, 11,391 to missing)
(404 real changes made, 404 to missing)
(440 real changes made, 440 to missing)
(11,309 real changes made, 11,309 to missing)
(459 real changes made, 459 to missing)
(539 real changes made, 539 to missing)
(13,629 real changes made, 13,629 to missing)
(470 real changes made, 470 to missing)
(477 real changes made, 477 to missing)

. 
. forval i=0/3 {
  2.     replace n_20`i'0_0_0 = . if n_20`i'0_0_0 < 0
  3.     replace n_20`i'0_1_0 = . if n_20`i'0_1_0 < 0
  4.     replace n_20`i'0_2_0 = . if n_20`i'0_2_0 < 0
  5. }
(17,857 real changes made, 17,857 to missing)
(743 real changes made, 743 to missing)
(873 real changes made, 873 to missing)
(15,980 real changes made, 15,980 to missing)
(608 real changes made, 608 to missing)
(655 real changes made, 655 to missing)
(6,831 real changes made, 6,831 to missing)
(222 real changes made, 222 to missing)
(284 real changes made, 284 to missing)
(11,300 real changes made, 11,300 to missing)
(396 real changes made, 396 to missing)
(413 real changes made, 413 to missing)

. 
. 
. forval i=0/2 {
  2.     egen depress_`i'=rmean(n_1920_`i'_0 n_1930_`i'_0 n_1940_`i'_0 n_1950_`
> i'_0 n_1960_`i'_0 n_1970_`i'_0 n_1980_`i'_0 n_1990_`i'_0 n_2000_`i'_0 n_2010_
> `i'_0 n_2020_`i'_0 n_2030_`i'_0)
  3. 
.     qui xi: reg depress_`i' SEX##c.AGE`i' SEX##c.AGE`i'sq SEX##c.AGE`i'cb
  4.     predict DEPRESS_`i', rstandard
  5. }
(104 missing values generated)
(104 missing values generated)
(426780 missing values generated)
(427,106 missing values generated)
(424319 missing values generated)
(426,383 missing values generated)

. 
. egen DEPRESS = rmean(DEPRESS_*)
(96 missing values generated)

. **********************************************************
. 
. 
. **********************************************************
. ****************** FAMILY SATISFACTION *******************
. **********************************************************
. forval i=0/2 {
  2.     gen famsat_`i'_0 = 7 - n_4559_`i'_0 if n_4559_`i'_0 > 0
  3.     qui xi: reg famsat_`i' SEX##c.AGE`i' SEX##c.AGE`i'sq SEX##c.AGE`i'cb
  4.     predict FAMSAT_`i', rstandard
  5. }
(300,500 missing values generated)
(300,500 missing values generated)
(426,939 missing values generated)
(427,257 missing values generated)
(424,487 missing values generated)
(426,533 missing values generated)

. 
. egen FAM_SATISF = rmean(FAMSAT_*)
(277672 missing values generated)

. **********************************************************
. 
. 
. **********************************************************
. ****************** FRIEND SATISFACTION *******************
. **********************************************************
. forval i=0/2 {
  2.     gen friendsat_`i' = 7 - n_4570_`i'_0 if n_4570_`i'_0 > 0
  3.     qui xi: reg friendsat_`i' SEX##c.AGE`i' SEX##c.AGE`i'sq SEX##c.AGE`i'c
> b
  4.     predict FRIENDSAT_`i', rstandard
  5. }
(300,765 missing values generated)
(300,765 missing values generated)
(426,983 missing values generated)
(427,306 missing values generated)
(424,579 missing values generated)
(426,612 missing values generated)

. 
. egen FRIEND_SATISF = rmean(FRIENDSAT_*)
(277984 missing values generated)

. **********************************************************
. 
. 
. **********************************************************
. ***************** FINANCIAL SATISFACTION *****************
. **********************************************************
. forval i=0/2 {
  2.     gen finsat_`i' = 7 - n_4581_`i'_0 if n_4581_`i'_0 > 0
  3.     qui xi: reg finsat_`i' SEX##c.AGE`i' SEX##c.AGE`i'sq SEX##c.AGE`i'cb
  4.     predict FINSAT_`i', rstandard
  5. }
(299,861 missing values generated)
(299,861 missing values generated)
(426,828 missing values generated)
(427,152 missing values generated)
(424,364 missing values generated)
(426,422 missing values generated)

. 
. egen FIN_SATISF = rmean(FINSAT_*)
(276934 missing values generated)

. **********************************************************
. 
. 
. **********************************************************
. ******************* WORK SATISFACTION ********************
. **********************************************************
. * 7 is unemployed
. forval i=0/2 {
  2.     gen worksat_`i' = 7 - n_4537_`i'_0 if (n_4537_`i'_0 > 0 & n_4537_`i'_0
>  != 7)
  3.     qui xi: reg worksat_`i' SEX##c.AGE`i' SEX##c.AGE`i'sq SEX##c.AGE`i'cb
  4.     predict WORKSAT_`i', rstandard
  5. }
(345,233 missing values generated)
(345,233 missing values generated)
(435,140 missing values generated)
(435,249 missing values generated)
(433,552 missing values generated)
(434,390 missing values generated)

. 
. egen WORK_SATISF = rmean(WORKSAT_*)
(330947 missing values generated)

. **********************************************************
. 
. 
. **********************************************************
. ********************** LONELINESS ************************
. **********************************************************
. forval i = 0/2 {
  2.     replace n_2020_`i'_0=. if n_2020_`i'_0<0
  3.     qui xi: reg n_2020_`i'_0 SEX##c.AGE`i' SEX##c.AGE`i'sq SEX##c.AGE`i'cb
  4.     predict LONELY_`i', rstandard
  5. }
(0 real changes made)
(6,837 missing values generated)
(0 real changes made)
(427,315 missing values generated)
(0 real changes made)
(426,633 missing values generated)

. 
. egen LONELY = rmean(LONELY_*)
(6460 missing values generated)

. **********************************************************
. 
. 
. **********************************************************
. *********************** SELFHEALTH ***********************
. **********************************************************
. * scale 1-4, was reverse coded
. forval i = 0/2 {
  2.     gen health_`i' = 5 - n_2178_`i'_0 if n_2178_`i'_0 > 0 
  3.     qui xi: reg health_`i' SEX##c.AGE`i' SEX##c.AGE`i'sq SEX##c.AGE`i'cb
  4.     predict HEALTH_`i', rstandard
  5. }
(1,665 missing values generated)
(1,665 missing values generated)
(426,799 missing values generated)
(427,124 missing values generated)
(424,347 missing values generated)
(426,407 missing values generated)

. 
. egen HEALTH = rmean(HEALTH_*)
(1599 missing values generated)

. **********************************************************
. 
. 
. **********************************************************
. ************************** ASTHMA ************************
. **********************************************************
. ** Update when we have data field 22127!!
. 
. gen ASTHMA = 0 if (!missing(s_41202_0_0) | !missing(s_41204_0_0) | ///
>     !missing(n_20002_0_0) | !missing(n_20002_1_0) | !missing(n_20002_2_0) | /
> //
>     (!missing(n_6152_0_0) & n_6152_0_0!=-3) | ///
>     (!missing(n_6152_1_0) & n_6152_1_0!=-3) | ///
>     (!missing(n_6152_2_0)) &  n_6152_2_0!=-3) 
(22 missing values generated)

. 
. 
. forval i = 0/379 {
  2.     replace ASTHMA = 1 if (s_41202_0_`i' == "J450" | s_41202_0_`i' == "J45
> 1" | ///
>             s_41202_0_`i' == "J458" |  s_41202_0_`i' == "J459" | ///
>             s_41202_0_`i' == "J46")
  3. }
(413 real changes made)
(448 real changes made)
(333 real changes made)
(284 real changes made)
(218 real changes made)
(182 real changes made)
(125 real changes made)
(95 real changes made)
(70 real changes made)
(63 real changes made)
(51 real changes made)
(43 real changes made)
(19 real changes made)
(16 real changes made)
(25 real changes made)
(7 real changes made)
(12 real changes made)
(11 real changes made)
(10 real changes made)
(3 real changes made)
(5 real changes made)
(5 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/434 {
  2.     replace ASTHMA = 1 if (s_41204_0_`i' == "J450" | s_41204_0_`i' == "J45
> 1" | ///
>             s_41204_0_`i' == "J458" |  s_41204_0_`i' == "J459"   | ///
>             s_41204_0_`i' == "J46")
  3. }
(4,469 real changes made)
(4,811 real changes made)
(3,806 real changes made)
(2,798 real changes made)
(2,154 real changes made)
(1,523 real changes made)
(1,190 real changes made)
(921 real changes made)
(738 real changes made)
(561 real changes made)
(461 real changes made)
(385 real changes made)
(300 real changes made)
(264 real changes made)
(201 real changes made)
(197 real changes made)
(143 real changes made)
(136 real changes made)
(102 real changes made)
(86 real changes made)
(66 real changes made)
(72 real changes made)
(65 real changes made)
(59 real changes made)
(45 real changes made)
(36 real changes made)
(24 real changes made)
(26 real changes made)
(32 real changes made)
(25 real changes made)
(21 real changes made)
(15 real changes made)
(12 real changes made)
(19 real changes made)
(18 real changes made)
(18 real changes made)
(8 real changes made)
(10 real changes made)
(9 real changes made)
(12 real changes made)
(9 real changes made)
(6 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(3 real changes made)
(6 real changes made)
(2 real changes made)
(3 real changes made)
(1 real change made)
(2 real changes made)
(3 real changes made)
(4 real changes made)
(2 real changes made)
(3 real changes made)
(1 real change made)
(2 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/28 {
  2.     replace ASTHMA = 1 if (n_20002_0_`i' == 1111 )
  3. }
(20,427 real changes made)
(6,925 real changes made)
(1,020 real changes made)
(318 real changes made)
(96 real changes made)
(22 real changes made)
(15 real changes made)
(6 real changes made)
(3 real changes made)
(1 real change made)
(1 real change made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/15 {
  2.     replace ASTHMA = 1 if (n_20002_1_`i' == 1111 )
  3. }
(153 real changes made)
(78 real changes made)
(17 real changes made)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/16 {
  2.     replace ASTHMA = 1 if (n_20002_2_`i' == 1111 )
  3. }
(200 real changes made)
(81 real changes made)
(19 real changes made)
(11 real changes made)
(4 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/3 {
  2.     forval j = 0/2 {
  3.         replace ASTHMA = 1 if n_6152_`j'_`i' == 8
  4.     }
  5. }
(605 real changes made)
(1 real change made)
(46 real changes made)
(40 real changes made)
(0 real changes made)
(3 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)

. replace ASTHMA = 1 if n_6152_0_4 == 8
(0 real changes made)

. 
. 
. 
. **********************************************************
. 
. 
. *rerun
. **********************************************************
. *********************** HAYFEVER *************************
. **********************************************************
. ** Update when we get data field 22126
. 
. gen HAYFVR = 0 if (!missing(s_41202_0_0) | !missing(s_41204_0_0) | ///
>     !missing(n_20002_0_0) | !missing(n_20002_1_0) | !missing(n_20002_2_0) | /
> //
>     (!missing(n_6152_0_0) & n_6152_0_0!=-3 & n_6152_0_0!=9) | ///
>     (!missing(n_6152_1_0) & n_6152_1_0!=-3 & n_6152_0_0!=9) | ///
>     (!missing(n_6152_2_0) & n_6152_2_0!=-3 & n_6152_0_0!=9)) 
(5,810 missing values generated)

. 
. 
. forval i = 0/379 {
  2.     replace HAYFVR = 1 if (s_41202_0_`i' == "J301" | s_41202_0_`i' == "J30
> 2" | ///
>         s_41202_0_`i' == "J303" |  s_41202_0_`i' == "J304")
  3. }
(18 real changes made)
(19 real changes made)
(10 real changes made)
(4 real changes made)
(6 real changes made)
(4 real changes made)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/434 {
  2.     replace HAYFVR = 1 if (s_41204_0_`i' == "J301" | s_41204_0_`i' == "J30
> 2" | ///
>         s_41204_0_`i' == "J303" |  s_41204_0_`i' == "J304")
  3. }
(105 real changes made)
(142 real changes made)
(131 real changes made)
(120 real changes made)
(80 real changes made)
(77 real changes made)
(65 real changes made)
(49 real changes made)
(29 real changes made)
(31 real changes made)
(27 real changes made)
(20 real changes made)
(18 real changes made)
(17 real changes made)
(13 real changes made)
(8 real changes made)
(11 real changes made)
(10 real changes made)
(13 real changes made)
(8 real changes made)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(3 real changes made)
(1 real change made)
(1 real change made)
(4 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/28 {
  2.     replace HAYFVR = 1 if (n_20002_0_`i' == 1387 )
  3. }
(7,846 real changes made)
(8,009 real changes made)
(4,356 real changes made)
(2,283 real changes made)
(1,074 real changes made)
(535 real changes made)
(311 real changes made)
(136 real changes made)
(78 real changes made)
(48 real changes made)
(33 real changes made)
(12 real changes made)
(9 real changes made)
(5 real changes made)
(4 real changes made)
(1 real change made)
(1 real change made)
(3 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/15 {
  2.     replace HAYFVR = 1 if (n_20002_1_`i' == 1387 )
  3. }
(248 real changes made)
(305 real changes made)
(246 real changes made)
(180 real changes made)
(95 real changes made)
(60 real changes made)
(26 real changes made)
(13 real changes made)
(4 real changes made)
(3 real changes made)
(2 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/16 {
  2.     replace HAYFVR = 1 if (n_20002_2_`i' == 1387 )
  3. }
(205 real changes made)
(272 real changes made)
(209 real changes made)
(141 real changes made)
(71 real changes made)
(29 real changes made)
(27 real changes made)
(6 real changes made)
(2 real changes made)
(2 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. **********************************************************
. 
. 
. 
. **********************************************************
. ************************ ECZEMA **************************
. **********************************************************
. gen ECZEMA = 0 if (!missing(s_41202_0_0) | !missing(s_41204_0_0) | ///
>     !missing(n_20002_0_0) | !missing(n_20002_1_0) | !missing(n_20002_2_0) | /
> //
>     (!missing(n_6152_0_0) & n_6152_0_0!=-3 & n_6152_0_0!=9) | ///
>     (!missing(n_6152_1_0) & n_6152_1_0!=-3 & n_6152_0_0!=9) | ///
>     (!missing(n_6152_2_0) & n_6152_2_0!=-3 & n_6152_0_0!=9)) 
(5,810 missing values generated)

. 
. 
. forval i = 0/379 {
  2.     replace ECZEMA = 1 if (s_41202_0_`i' == "L20" | s_41202_0_`i' == "L208
> " | ///
>         s_41202_0_`i' == "J209")
  3. }
(12 real changes made)
(13 real changes made)
(17 real changes made)
(9 real changes made)
(9 real changes made)
(11 real changes made)
(10 real changes made)
(6 real changes made)
(1 real change made)
(8 real changes made)
(1 real change made)
(7 real changes made)
(0 real changes made)
(3 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/434 {
  2.     replace ECZEMA = 1 if (s_41204_0_`i' == "L20" | s_41204_0_`i' == "L208
> " | ///
>         s_41204_0_`i' == "J209")
  3. }
(2 real changes made)
(5 real changes made)
(1 real change made)
(5 real changes made)
(3 real changes made)
(1 real change made)
(2 real changes made)
(1 real change made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/28 {
  2.     replace ECZEMA = 1 if (n_20002_0_`i' == 1452 )
  3. }
(2,878 real changes made)
(3,732 real changes made)
(2,238 real changes made)
(1,162 real changes made)
(603 real changes made)
(370 real changes made)
(197 real changes made)
(93 real changes made)
(57 real changes made)
(30 real changes made)
(18 real changes made)
(7 real changes made)
(2 real changes made)
(6 real changes made)
(5 real changes made)
(6 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/15 {
  2.     replace ECZEMA = 1 if (n_20002_1_`i' == 1452 )
  3. }
(116 real changes made)
(171 real changes made)
(142 real changes made)
(92 real changes made)
(59 real changes made)
(34 real changes made)
(12 real changes made)
(14 real changes made)
(2 real changes made)
(2 real changes made)
(4 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/16 {
  2.     replace ECZEMA = 1 if (n_20002_2_`i' == 1452 )
  3. }
(144 real changes made)
(167 real changes made)
(140 real changes made)
(91 real changes made)
(48 real changes made)
(24 real changes made)
(15 real changes made)
(8 real changes made)
(4 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)

. **********************************************************
. 
. 
. **********************************************************
. ******************* HAYFEVER & ECZEMA ********************
. **********************************************************
. gen ECZRHI = 0 if (!missing(s_41202_0_0) | !missing(s_41204_0_0) | ///
>     !missing(n_20002_0_0) | !missing(n_20002_1_0) | !missing(n_20002_2_0) | /
> //
>     (!missing(n_6152_0_0) & n_6152_0_0!=-3) | ///
>     (!missing(n_6152_1_0) & n_6152_1_0!=-3) | ///
>     (!missing(n_6152_2_0) &  n_6152_2_0!=-3)) 
(22 missing values generated)

. 
. 
. forval i = 0/2 {
  2.     forval j = 0/3 {
  3.         replace ECZRHI = 1 if n_6152_`i'_`j' == 9
  4.     }
  5. }
(76,580 real changes made)
(23,475 real changes made)
(1,781 real changes made)
(183 real changes made)
(644 real changes made)
(168 real changes made)
(14 real changes made)
(3 real changes made)
(746 real changes made)
(165 real changes made)
(13 real changes made)
(0 real changes made)

.     
. replace ECZRHI = 1 if n_6152_0_4 == 9
(15 real changes made)

. 
. forval i = 0/379 {
  2.     replace ECZRHI = 1 if (s_41202_0_`i' == "J301" | s_41202_0_`i' == "J30
> 2" | ///
>         s_41202_0_`i' == "J303" |  s_41202_0_`i' == "J304" | s_41202_0_`i' ==
>  "L20" | /// 
>         s_41202_0_`i' == "L208" |  s_41202_0_`i' == "J209")
  3. }
(10 real changes made)
(16 real changes made)
(15 real changes made)
(7 real changes made)
(8 real changes made)
(9 real changes made)
(9 real changes made)
(6 real changes made)
(1 real change made)
(6 real changes made)
(0 real changes made)
(5 real changes made)
(0 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/434 {
  2.     replace ECZRHI = 1 if (s_41204_0_`i' == "J301" | s_41204_0_`i' == "J30
> 2" | ///
>         s_41204_0_`i' == "J303" |  s_41204_0_`i' == "J304" | s_41204_0_`i' ==
>  "L20" | ///
>         s_41204_0_`i' == "L208" |  s_41204_0_`i' == "J209")
  3. }
(26 real changes made)
(23 real changes made)
(23 real changes made)
(30 real changes made)
(10 real changes made)
(13 real changes made)
(16 real changes made)
(10 real changes made)
(7 real changes made)
(6 real changes made)
(3 real changes made)
(5 real changes made)
(2 real changes made)
(0 real changes made)
(1 real change made)
(2 real changes made)
(4 real changes made)
(2 real changes made)
(3 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/28 {
  2.     replace ECZRHI = 1 if (n_20002_0_`i' == 1387 | n_20002_0_`i' == 1452)
  3. }
(1,520 real changes made)
(1,712 real changes made)
(1,020 real changes made)
(547 real changes made)
(295 real changes made)
(179 real changes made)
(108 real changes made)
(56 real changes made)
(32 real changes made)
(11 real changes made)
(8 real changes made)
(5 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/15 {
  2.     replace ECZRHI = 1 if (n_20002_1_`i' == 1387 | n_20002_1_`i' == 1452)
  3. }
(95 real changes made)
(108 real changes made)
(90 real changes made)
(78 real changes made)
(32 real changes made)
(26 real changes made)
(7 real changes made)
(10 real changes made)
(2 real changes made)
(1 real change made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/16 {
  2.     replace ECZRHI = 1 if (n_20002_2_`i' == 1387 | n_20002_2_`i' == 1452)
  3. }
(97 real changes made)
(117 real changes made)
(84 real changes made)
(55 real changes made)
(22 real changes made)
(13 real changes made)
(14 real changes made)
(4 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. **********************************************************
. 
. 
. 
. **********************************************************
. ************** ASTHMA / HAYFEVER/ECZEMA ******************
. **********************************************************
. gen ASTECZRHI=.
(445,985 missing values generated)

. replace ASTECZRHI=1 if (ASTHMA==1 | ECZRHI==1)
(141,504 real changes made)

. replace ASTECZRHI=0 if (ASTHMA==0 & ECZRHI==0)
(304,459 real changes made)

. 
. **********************************************************
. 
. 
. 
. **********************************************************
. *********************** EVERSMOKE ************************
. **********************************************************
. 
. forval i = 0/2 {
  2.     gen current_`i' = 1 if n_1239_`i'_0 == 1 
  3.     replace current_`i' = 0 if n_1239_`i'_0 == 0 |  n_1239_`i'_0 == 2
  4. 
.     gen past_`i' = 1 if n_1249_`i'_0 == 1 | (n_1249_`i'_0 == 2 & n_2644_`i'_0
>  == 1) | (n_1249_`i'_0 == 3 & n_2644_`i'_0 == 1)
  5.     replace past_`i' = 0 if n_1249_`i'_0 == 4 | (n_1249_`i'_0 == 2 & n_264
> 4_`i'_0 == 0) | (n_1249_`i'_0 == 3 & n_2644_`i'_0 == 0)
  6. 
.     egen EVERSMOKE_`i'=rmax(current_`i' past_`i')
  7. }
(411,498 missing values generated)
(411,260 real changes made)
(280,424 missing values generated)
(239,271 real changes made)
(136 missing values generated)
(445,375 missing values generated)
(18,597 real changes made)
(438,940 missing values generated)
(11,267 real changes made)
(426777 missing values generated)
(445,468 missing values generated)
(21,151 real changes made)
(438,300 missing values generated)
(13,160 real changes made)
(424317 missing values generated)

. 
. egen EVERSMOKE = rmax(EVERSMOKE_*)
(125 missing values generated)

. 
. **********************************************************
. 
. 
. *rerun
. **********************************************************
. ******************* CIGARETTES PER DAY *******************
. **********************************************************
. 
. forval i = 0/2 {
  2.     replace n_3456_`i'_0=. if n_3456_`i'_0 < 1 | n_3456_`i'_0 > 100
  3.     replace n_2887_`i'_0=. if n_2887_`i'_0 < 1 | n_2887_`i'_0 > 100
  4.     replace n_6183_`i'_0=. if n_6183_`i'_0 < 1 | n_6183_`i'_0 > 100
  5. }
(290 real changes made, 290 to missing)
(783 real changes made, 783 to missing)
(54 real changes made, 54 to missing)
(2 real changes made, 2 to missing)
(34 real changes made, 34 to missing)
(2 real changes made, 2 to missing)
(3 real changes made, 3 to missing)
(38 real changes made, 38 to missing)
(2 real changes made, 2 to missing)

. 
. egen CPD = rmean(n_3456_* n_2887_* n_6183_*)
(306825 missing values generated)

. 
. * GSCAN binning:
. * a. 1 = 1-5
. * b. 2 = 6-15
. * c. 3 = 16-25
. * d. 4 = 26-35
. * e. 5 = 36+
. 
. gen CPDbins=1 if CPD > 0 & CPD <= 5
(437,029 missing values generated)

. replace CPDbins=2 if CPD > 5 & CPD <= 15
(55,924 real changes made)

. replace CPDbins=3 if CPD > 15 & CPD <= 25
(54,918 real changes made)

. replace CPDbins=4 if CPD > 25 & CPD <= 35
(10,927 real changes made)

. replace CPDbins=5 if CPD > 35 & CPD != .
(8,435 real changes made)

. **********************************************************
. 
. 
. *rerun
. **********************************************************
. ******************** DRINKS PER WEEK *********************
. **********************************************************
. forval i = 0/2 {
  2.     forval j=56/60 {
  3.         replace n_1`j'8_`i'_0 = . if n_1`j'8_`i'_0 < 0
  4.     }
  5. 
.     replace n_5364_`i'_0 = . if n_5364_`i'_0 < 0
  6.     replace n_4407_`i'_0 = . if n_4407_`i'_0 < 0
  7.     replace n_4418_`i'_0 = . if n_4418_`i'_0 < 0
  8.     replace n_4429_`i'_0 = . if n_4429_`i'_0 < 0
  9.     replace n_4440_`i'_0 = . if n_4440_`i'_0 < 0
 10.     replace n_4451_`i'_0 = . if n_4451_`i'_0 < 0
 11.     replace n_4462_`i'_0 = . if n_4462_`i'_0 < 0
 12. }
(1,792 real changes made, 1,792 to missing)
(2,001 real changes made, 2,001 to missing)
(1,200 real changes made, 1,200 to missing)
(2,225 real changes made, 2,225 to missing)
(1,259 real changes made, 1,259 to missing)
(248 real changes made, 248 to missing)
(280 real changes made, 280 to missing)
(316 real changes made, 316 to missing)
(213 real changes made, 213 to missing)
(338 real changes made, 338 to missing)
(170 real changes made, 170 to missing)
(130 real changes made, 130 to missing)
(27 real changes made, 27 to missing)
(33 real changes made, 33 to missing)
(25 real changes made, 25 to missing)
(29 real changes made, 29 to missing)
(18 real changes made, 18 to missing)
(10 real changes made, 10 to missing)
(18 real changes made, 18 to missing)
(18 real changes made, 18 to missing)
(11 real changes made, 11 to missing)
(26 real changes made, 26 to missing)
(10 real changes made, 10 to missing)
(5 real changes made, 5 to missing)
(42 real changes made, 42 to missing)
(42 real changes made, 42 to missing)
(25 real changes made, 25 to missing)
(57 real changes made, 57 to missing)
(34 real changes made, 34 to missing)
(18 real changes made, 18 to missing)
(22 real changes made, 22 to missing)
(16 real changes made, 16 to missing)
(15 real changes made, 15 to missing)
(20 real changes made, 20 to missing)
(7 real changes made, 7 to missing)
(7 real changes made, 7 to missing)

. 
. forval i = 0/2 {
  2.     * Set to sum of drinks if not less frequent than once or twice per wee
> k 
.     egen AW_`i' = rowtotal(n_1568_`i'_0 n_1578_`i'_0 n_1588_`i'_0 n_1598_`i'_
> 0 n_1608_`i'_0 n_5364_`i'_0) if  (n_1568_`i'_0!=. | n_1578_`i'_0!=. | n_1588_
> `i'_0!=. | n_1598_`i'_0!=. |  n_1608_`i'_0!=. |  n_5364_`i'_0!=.)
  3. 
.  
.     * If less frequent than once or twice per week, replace with rescaled mon
> thly value 
.     egen AM_`i' = rowtotal(n_4407_`i'_0 n_4418_`i'_0 n_4429_`i'_0 n_4440_`i'_
> 0 n_4451_`i'_0 n_4462_`i'_0) if (n_4407_`i'_0!=. | n_4418_`i'_0!=. | n_4429_`
> i'_0!=. | n_4440_`i'_0!=. | n_4451_`i'_0!=. | n_4462_`i'_0!=.)
  4. 
.     replace AW_`i'= AM_`i' / 4 if (n_1558_`i'_0 == 4 | n_1558_`i'_0 == 5 )
  5.     
.     * Set to 0 if never drinks 
.     replace AW_`i'= 0 if n_1558_`i'_0 == 6
  6. 
.     qui xi: reg AW_`i' SEX##c.AGE`i' SEX##c.AGE`i'sq SEX##c.AGE`i'cb
  7.     predict DPW_`i', rstandard
  8. }
(127108 missing values generated)
(413370 missing values generated)
(32,615 real changes made)
(29,668 real changes made)
(64,825 missing values generated)
(432070 missing values generated)
(441877 missing values generated)
(4,108 real changes made)
(1,184 real changes made)
(427,104 missing values generated)
(430210 missing values generated)
(441369 missing values generated)
(4,616 real changes made)
(1,273 real changes made)
(426,383 missing values generated)

. 
. egen DPW = rmean(DPW_*)
(60431 missing values generated)

. 
. **********************************************************
. 
. 
. 
. **********************************************************
. ************************** COPD **************************
. **********************************************************
. * ICD10 codes received from here:
. * https://www.cigna.com/static/docs/starplus/icd10-copd.pdf
. 
. gen COPD = 0 if (!missing(s_41202_0_0) | !missing(s_41204_0_0) | ///
>     !missing(n_20002_0_0) | !missing(n_20002_1_0) | !missing(n_20002_2_0) | /
> //
>     (!missing(n_6152_0_0) & n_6152_0_0!=-3) | ///
>     (!missing(n_6152_1_0) & n_6152_1_0!=-3) | ///
>     (!missing(n_6152_2_0)) &  n_6152_2_0!=-3) 
(22 missing values generated)

. 
. forval i = 0/379 {
  2.     replace COPD = 1 if (s_41202_0_`i' == "J440" | s_41202_0_`i' == "J441"
>  | ///
>              s_41202_0_`i' == "J448" |  s_41202_0_`i' == "J449" | s_41202_0_`
> i' == "J410" | ///
>              s_41202_0_`i' == "J411" | s_41202_0_`i' == "J418" | s_41202_0_`i
> ' == "J42" | ///
>              s_41202_0_`i' == "J430" | s_41202_0_`i' == "J431" | s_41202_0_`i
> ' == "J432" | ///
>              s_41202_0_`i' == "J438" | s_41202_0_`i' == "J439" | s_41202_0_`i
> ' == "J982" | ///
>              s_41202_0_`i' == "J983")
  3. }
(225 real changes made)
(287 real changes made)
(306 real changes made)
(262 real changes made)
(232 real changes made)
(230 real changes made)
(169 real changes made)
(143 real changes made)
(109 real changes made)
(89 real changes made)
(63 real changes made)
(62 real changes made)
(44 real changes made)
(35 real changes made)
(26 real changes made)
(23 real changes made)
(21 real changes made)
(19 real changes made)
(9 real changes made)
(9 real changes made)
(13 real changes made)
(6 real changes made)
(10 real changes made)
(7 real changes made)
(8 real changes made)
(7 real changes made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(1 real change made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/434 {
  2.     replace COPD = 1 if (s_41204_0_`i' == "J440" | s_41204_0_`i' == "J441"
>  | ///
>              s_41204_0_`i' == "J448" |  s_41204_0_`i' == "J449" | s_41204_0_`
> i' == "J410" | ///
>              s_41204_0_`i' == "J411" | s_41204_0_`i' == "J418" | s_41204_0_`i
> ' == "J42" | ///
>              s_41204_0_`i' == "J430" | s_41204_0_`i' == "J431" | s_41204_0_`i
> ' == "J432" | ///
>              s_41204_0_`i' == "J438" | s_41204_0_`i' == "J439" | s_41204_0_`i
> ' == "J982" | ///
>              s_41204_0_`i' == "J983")
  3. }
(433 real changes made)
(667 real changes made)
(706 real changes made)
(666 real changes made)
(572 real changes made)
(490 real changes made)
(472 real changes made)
(408 real changes made)
(340 real changes made)
(325 real changes made)
(283 real changes made)
(238 real changes made)
(232 real changes made)
(230 real changes made)
(174 real changes made)
(170 real changes made)
(138 real changes made)
(122 real changes made)
(114 real changes made)
(100 real changes made)
(78 real changes made)
(80 real changes made)
(65 real changes made)
(64 real changes made)
(69 real changes made)
(45 real changes made)
(43 real changes made)
(32 real changes made)
(36 real changes made)
(32 real changes made)
(27 real changes made)
(27 real changes made)
(30 real changes made)
(25 real changes made)
(15 real changes made)
(19 real changes made)
(17 real changes made)
(18 real changes made)
(20 real changes made)
(16 real changes made)
(7 real changes made)
(13 real changes made)
(7 real changes made)
(10 real changes made)
(6 real changes made)
(2 real changes made)
(2 real changes made)
(3 real changes made)
(2 real changes made)
(3 real changes made)
(1 real change made)
(5 real changes made)
(5 real changes made)
(2 real changes made)
(3 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(1 real change made)
(2 real changes made)
(1 real change made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/28 {
  2.     replace COPD = 1 if (n_20002_0_`i' == 1112 | n_20002_0_`i' == 1113)
  3. }
(2,302 real changes made)
(1,370 real changes made)
(384 real changes made)
(138 real changes made)
(43 real changes made)
(18 real changes made)
(8 real changes made)
(1 real change made)
(2 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/15 {
  2.     replace COPD = 1 if (n_20002_1_`i' == 1112 | n_20002_1_`i' == 1113)
  3. }
(52 real changes made)
(47 real changes made)
(19 real changes made)
(4 real changes made)
(1 real change made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/16 {
  2.     replace COPD = 1 if (n_20002_2_`i' == 1112 | n_20002_2_`i' == 1113)
  3. }
(84 real changes made)
(49 real changes made)
(18 real changes made)
(6 real changes made)
(4 real changes made)
(3 real changes made)
(1 real change made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/3 {
  2.     forval j = 0/2 {
  3.         replace COPD = 1 if n_6152_`j'_`i' == 6
  4.     }
  5. }
(794 real changes made)
(9 real changes made)
(29 real changes made)
(30 real changes made)
(2 real changes made)
(0 real changes made)
(6 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. replace COPD = 1 if n_6152_0_4 == 6
(0 real changes made)

. 
. **********************************************************
. 
. 
. *rerun
. **********************************************************
. ************************* MIGRAINE ***********************
. **********************************************************
. gen MIGRAINE = 0 if (!missing(s_41202_0_0) | !missing(s_41204_0_0) | ///
>         !missing(n_20002_0_0) | !missing(n_20002_1_0) | !missing(n_20002_2_0)
> )
(35,979 missing values generated)

. 
. 
. forval i = 0/379 {
  2.     replace MIGRAINE = 1 if (s_41202_0_`i' == "G430" | s_41202_0_`i' == "G
> 431" | ///
>             s_41202_0_`i' == "G432" |  s_41202_0_`i' == "G433" | ///
>             s_41202_0_`i' == "G438" | s_41202_0_`i' == "G439")
  3. }
(174 real changes made)
(232 real changes made)
(200 real changes made)
(181 real changes made)
(139 real changes made)
(118 real changes made)
(110 real changes made)
(72 real changes made)
(53 real changes made)
(47 real changes made)
(46 real changes made)
(30 real changes made)
(21 real changes made)
(15 real changes made)
(7 real changes made)
(9 real changes made)
(10 real changes made)
(9 real changes made)
(7 real changes made)
(3 real changes made)
(3 real changes made)
(4 real changes made)
(3 real changes made)
(5 real changes made)
(3 real changes made)
(0 real changes made)
(3 real changes made)
(0 real changes made)
(1 real change made)
(2 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/434 {
  2.     replace MIGRAINE = 1 if (s_41204_0_`i' == "G430" | s_41204_0_`i' == "G
> 431" | ///
>             s_41204_0_`i' == "G432" |  s_41204_0_`i' == "G433"   | ///
>             s_41204_0_`i' == "G438" | s_41204_0_`i' == "G439")
  3. }
(83 real changes made)
(154 real changes made)
(150 real changes made)
(111 real changes made)
(142 real changes made)
(95 real changes made)
(103 real changes made)
(61 real changes made)
(79 real changes made)
(55 real changes made)
(53 real changes made)
(41 real changes made)
(44 real changes made)
(32 real changes made)
(34 real changes made)
(32 real changes made)
(19 real changes made)
(19 real changes made)
(13 real changes made)
(12 real changes made)
(12 real changes made)
(13 real changes made)
(8 real changes made)
(6 real changes made)
(10 real changes made)
(11 real changes made)
(9 real changes made)
(9 real changes made)
(3 real changes made)
(5 real changes made)
(4 real changes made)
(5 real changes made)
(0 real changes made)
(3 real changes made)
(2 real changes made)
(4 real changes made)
(3 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/28 {
  2.     replace MIGRAINE = 1 if (n_20002_0_`i' == 1265 )
  3. }
(4,150 real changes made)
(3,447 real changes made)
(2,069 real changes made)
(1,088 real changes made)
(580 real changes made)
(342 real changes made)
(166 real changes made)
(93 real changes made)
(43 real changes made)
(38 real changes made)
(23 real changes made)
(11 real changes made)
(9 real changes made)
(0 real changes made)
(2 real changes made)
(1 real change made)
(2 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/15 {
  2.     replace MIGRAINE = 1 if (n_20002_1_`i' == 1265 )
  3. }
(46 real changes made)
(53 real changes made)
(79 real changes made)
(89 real changes made)
(87 real changes made)
(76 real changes made)
(56 real changes made)
(31 real changes made)
(20 real changes made)
(5 real changes made)
(3 real changes made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forval i = 0/16 {
  2.     replace MIGRAINE  = 1 if (n_20002_2_`i' == 1265 )
  3. }
(68 real changes made)
(49 real changes made)
(49 real changes made)
(44 real changes made)
(47 real changes made)
(47 real changes made)
(29 real changes made)
(23 real changes made)
(21 real changes made)
(16 real changes made)
(13 real changes made)
(6 real changes made)
(1 real change made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)

. 
. **********************************************************
. 
. 
. 
. **********************************************************
. ******************** AGE AT FIRST BIRTH ******************
. **********************************************************
. * minimum age of all times answered
. gen AFB_0 = n_2754_0_0 if n_2754_0_0 > 0
(281,016 missing values generated)

. gen AFB_1 = n_2754_1_0 if n_2754_1_0 > 0
(439,405 missing values generated)

. gen AFB_2 = n_2754_2_0 if n_2754_2_0 > 0
(438,586 missing values generated)

. gen AFB_0b = n_3872_0_0 if n_3872_0_0 > 0
(414,165 missing values generated)

. gen AFB_1b = n_3872_1_0 if n_3872_1_0 > 0
(444,757 missing values generated)

. gen AFB_2b = n_3872_2_0 if n_3872_2_0 > 0
(444,487 missing values generated)

. egen AFB = rmin(AFB_*)
(249171 missing values generated)

. **********************************************************
. 
. 
. 
. **********************************************************
. ******************** NUMBER EVER BORN ********************
. **********************************************************
. * max of number all reported children
. gen N_EVERBORN_WOMEN_0 = n_2734_0_0 if n_2734_0_0 >= 0
(204,150 missing values generated)

. gen N_EVERBORN_WOMEN_1 = n_2734_1_0 if n_2734_1_0 >= 0
(436,179 missing values generated)

. gen N_EVERBORN_WOMEN_2 = n_2734_2_0 if n_2734_2_0 >= 0
(434,859 missing values generated)

. egen N_EVERBORN_WOMEN = rmax(N_EVERBORN_WOMEN_*)
(204143 missing values generated)

. 
. gen N_EVERBORN_MEN_0 = n_2405_0_0 if n_2405_0_0 >= 0
(243,721 missing values generated)

. gen N_EVERBORN_MEN_1 = n_2405_1_0 if n_2405_1_0 >= 0
(436,627 missing values generated)

. gen N_EVERBORN_MEN_2 = n_2405_2_0 if n_2405_2_0 >= 0
(435,494 missing values generated)

. egen N_EVERBORN_MEN = rmax(N_EVERBORN_MEN_*)
(243471 missing values generated)

. 
. 
. **********************************************************************
. **********************************************************************
. 
. *** SAVE FULL DATASET ***
. keep n_eid SEX BATCH BYEAR IQ EA RISK HEIGHT BMI NEURO MORNING RELIG SWB HEAL
> TH AFB N_EVERBORN_MEN  ///
>     N_EVERBORN_WOMEN HAYFVR ECZEMA ECZRHI ASTECZRHI FAM_SATISF FRIEND_SATISF 
> WORK_SATISF FIN_SATISF ///
>     LONELY CPD CPDbins COPD ASTHMA MIGRAINE DEPRESS DPW EVERSMOKE IQ EA RISK 
> CANNABIS EVERCANNABIS /// 
>     logAUDIT MYOPIA MENARCHE ALZM ALZF F_age M_age PC*

. 
. save "tmp/pgs_repo.dta", replace
file tmp/pgs_repo.dta saved

. 
. 
. *****************************************************************************
> *****
. *****************************************************************************
> *****
. 
. ****************************************
. **** Split into 3 equal partitions *****
. ****************************************
. clear

. import delimited `partition_data', delim("\t")
(2 vars, 175,051 obs)

. merge 1:1 n_eid using "tmp/pgs_repo.dta", keep(match using)

    Result                           # of obs.
    -----------------------------------------
    not matched                       279,537
        from master                         0  (_merge==1)
        from using                    279,537  (_merge==2)

    matched                           166,448  (_merge==3)
    -----------------------------------------

. 
. * Get maximum order in IDs_assignPartition_ordered.txt after merging 
. qui sum partition_order

. 
. * For observations not in brain sample + relateds list, assign random value g
> reater than maximum order to partition_order 
. local maxorder =`r(max)'+1

. replace partition_order=runiform()+`maxorder' if partition_order==.
variable partition_order was long now double
(279,537 real changes made)

. 
. * Assign into partitions based on partition order
. sort partition_order

. gen partition = ceil(3 * _n/_N)

. save "tmp/pgs_repo.dta", replace
file tmp/pgs_repo.dta saved

. 
. ****************************************
. ********* Convert to GWAS IDs **********
. ****************************************
. 
. clear 

. import delimited `crosswalk', delim(" ")
(2 vars, 487,409 obs)

. ren (v1 v2) (IID n_eid)

. destring n_eid, replace ignore(" ")
n_eid already numeric; no replace

. merge 1:1 n_eid using "tmp/pgs_repo.dta", nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                        41,424
        from master                    41,424  
        from using                          0  

    matched                           445,985  
    -----------------------------------------

. gen FID=IID

. 
. 
. ****************************************
. ********* RESIDUALIZE & EXPORT *********
. ****************************************
. 
. gen BYEAR2 = BYEAR*BYEAR
(41,424 missing values generated)

. gen BYEAR3 = BYEAR2*BYEAR
(41,424 missing values generated)

. gen SEXxBYEAR = SEX*BYEAR
(41,424 missing values generated)

. gen SEXxBYEAR2 = SEX*BYEAR2
(41,424 missing values generated)

. gen SEXxBYEAR3 = SEX*BYEAR3
(41,424 missing values generated)

. gen F_agesq=F_age*F_age
(86,173 missing values generated)

. gen F_agecb=F_agesq*F_age
(86,173 missing values generated)

. gen M_agesq=M_age*M_age
(70,765 missing values generated)

. gen M_agecb=M_agesq*M_age
(70,765 missing values generated)

. 
. foreach partition in 1 2 3 {
  2.     foreach var of varlist FAM_SATISF FRIEND_SATISF WORK_SATISF FIN_SATISF
>  ///
>         LONELY CPD CPDbins COPD ASTHMA MIGRAINE DEPRESS DPW EVERSMOKE ///
>         HEIGHT BMI NEURO MORNING RELIG SWB HEALTH HAYFVR ECZEMA ECZRHI /// 
>         ASTECZRHI EA IQ RISK CANNABIS EVERCANNABIS logAUDIT MYOPIA MENARCHE {
  3.         
.         qui xi:reg `var' BYEAR* SEX* i.BATCH PC1-PC40 if partition==`partitio
> n'
  4.         predict resid, rstandard
  5.         replace resid=. if partition!=`partition'
  6.         export delimited FID IID resid using "input/UKB_`var'_part`partiti
> on'.pheno", noq delim(" ") replace
  7. 
.         drop resid
  8.         }
  9. 
. 
.     * sex specific phenotypes:
.     foreach var of varlist AFB N_EVERBORN_MEN N_EVERBORN_WOMEN {
 10.         
.         qui xi:reg `var' BYEAR* i.BATCH PC1-PC40 if partition==`partition'
 11.         predict resid, rstandard
 12.         replace resid=. if partition!=`partition'
 13.         export delimited FID IID resid using "input/UKB_`var'_part`partiti
> on'.pheno", noq delim(" ") replace
 14. 
.         drop resid
 15.     }
 16. 
. 
.   
.     qui xi:reg ALZF F_age F_agesq F_agecb i.BATCH PC1-PC40 if partition==`par
> tition'
 17.     predict resid, rstandard
 18.     replace resid=. if partition!=`partition'
 19.     export delimited FID IID resid using "input/UKB_ALZfather_part`partiti
> on'.pheno", noq delim(" ") replace
 20. 
.     drop resid
 21. 
.     qui xi:reg ALZM M_age M_agesq M_agecb i.BATCH PC1-PC40 if partition==`par
> tition'
 22.     predict resid, rstandard
 23.     replace resid=. if partition!=`partition'
 24.     export delimited FID IID resid using "input/UKB_ALZmother_part`partiti
> on'.pheno", noq delim(" ") replace
 25. 
.     drop resid
 26. 
. 
. }
(319,096 missing values generated)
(106,557 real changes made, 106,557 to missing)
(note: file input/UKB_FAM_SATISF_part1.pheno not found)
file input/UKB_FAM_SATISF_part1.pheno saved
(319,408 missing values generated)
(106,487 real changes made, 106,487 to missing)
(note: file input/UKB_FRIEND_SATISF_part1.pheno not found)
file input/UKB_FRIEND_SATISF_part1.pheno saved
(372,371 missing values generated)
(72,601 real changes made, 72,601 to missing)
(note: file input/UKB_WORK_SATISF_part1.pheno not found)
file input/UKB_WORK_SATISF_part1.pheno saved
(318,358 missing values generated)
(107,157 real changes made, 107,157 to missing)
(note: file input/UKB_FIN_SATISF_part1.pheno not found)
file input/UKB_FIN_SATISF_part1.pheno saved
(47,884 missing values generated)
(292,808 real changes made, 292,808 to missing)
(note: file input/UKB_LONELY_part1.pheno not found)
file input/UKB_LONELY_part1.pheno saved
(348,249 missing values generated)
(93,070 real changes made, 93,070 to missing)
(note: file input/UKB_CPD_part1.pheno not found)
file input/UKB_CPD_part1.pheno saved
(348,249 missing values generated)
(93,070 real changes made, 93,070 to missing)
(note: file input/UKB_CPDbins_part1.pheno not found)
file input/UKB_CPDbins_part1.pheno saved
(41,446 missing values generated)
(297,310 real changes made, 297,310 to missing)
(note: file input/UKB_COPD_part1.pheno not found)
file input/UKB_COPD_part1.pheno saved
(41,446 missing values generated)
(297,310 real changes made, 297,310 to missing)
(note: file input/UKB_ASTHMA_part1.pheno not found)
file input/UKB_ASTHMA_part1.pheno saved
(77,403 missing values generated)
(272,685 real changes made, 272,685 to missing)
(note: file input/UKB_MIGRAINE_part1.pheno not found)
file input/UKB_MIGRAINE_part1.pheno saved
(41,520 missing values generated)
(297,251 real changes made, 297,251 to missing)
(note: file input/UKB_DEPRESS_part1.pheno not found)
file input/UKB_DEPRESS_part1.pheno saved
(101,855 missing values generated)
(256,078 real changes made, 256,078 to missing)
(note: file input/UKB_DPW_part1.pheno not found)
file input/UKB_DPW_part1.pheno saved
(41,549 missing values generated)
(297,231 real changes made, 297,231 to missing)
(note: file input/UKB_EVERSMOKE_part1.pheno not found)
file input/UKB_EVERSMOKE_part1.pheno saved
(42,355 missing values generated)
(296,624 real changes made, 296,624 to missing)
(note: file input/UKB_HEIGHT_part1.pheno not found)
file input/UKB_HEIGHT_part1.pheno saved
(48,933 missing values generated)
(292,085 real changes made, 292,085 to missing)
(note: file input/UKB_BMI_part1.pheno not found)
file input/UKB_BMI_part1.pheno saved
(125,721 missing values generated)
(240,416 real changes made, 240,416 to missing)
(note: file input/UKB_NEURO_part1.pheno not found)
file input/UKB_NEURO_part1.pheno saved
(86,333 missing values generated)
(266,703 real changes made, 266,703 to missing)
(note: file input/UKB_MORNING_part1.pheno not found)
file input/UKB_MORNING_part1.pheno saved
(42,567 missing values generated)
(296,529 real changes made, 296,529 to missing)
(note: file input/UKB_RELIG_part1.pheno not found)
file input/UKB_RELIG_part1.pheno saved
(318,190 missing values generated)
(107,290 real changes made, 107,290 to missing)
(note: file input/UKB_SWB_part1.pheno not found)
file input/UKB_SWB_part1.pheno saved
(43,023 missing values generated)
(296,191 real changes made, 296,191 to missing)
(note: file input/UKB_HEALTH_part1.pheno not found)
file input/UKB_HEALTH_part1.pheno saved
(47,234 missing values generated)
(293,242 real changes made, 293,242 to missing)
(note: file input/UKB_HAYFVR_part1.pheno not found)
file input/UKB_HAYFVR_part1.pheno saved
(47,234 missing values generated)
(293,242 real changes made, 293,242 to missing)
(note: file input/UKB_ECZEMA_part1.pheno not found)
file input/UKB_ECZEMA_part1.pheno saved
(41,446 missing values generated)
(297,310 real changes made, 297,310 to missing)
(note: file input/UKB_ECZRHI_part1.pheno not found)
file input/UKB_ECZRHI_part1.pheno saved
(41,446 missing values generated)
(297,310 real changes made, 297,310 to missing)
(note: file input/UKB_ASTECZRHI_part1.pheno not found)
file input/UKB_ASTECZRHI_part1.pheno saved
(45,320 missing values generated)
(294,624 real changes made, 294,624 to missing)
(note: file input/UKB_EA_part1.pheno not found)
file input/UKB_EA_part1.pheno saved
(262,353 missing values generated)
(144,445 real changes made, 144,445 to missing)
(note: file input/UKB_IQ_part1.pheno not found)
file input/UKB_IQ_part1.pheno saved
(41,425 missing values generated)
(297,323 real changes made, 297,323 to missing)
(note: file input/UKB_RISK_part1.pheno not found)
file input/UKB_RISK_part1.pheno saved
(343,297 missing values generated)
(88,240 real changes made, 88,240 to missing)
(note: file input/UKB_CANNABIS_part1.pheno not found)
file input/UKB_CANNABIS_part1.pheno saved
(343,297 missing values generated)
(88,240 real changes made, 88,240 to missing)
(note: file input/UKB_EVERCANNABIS_part1.pheno not found)
file input/UKB_EVERCANNABIS_part1.pheno saved
(355,749 missing values generated)
(80,534 real changes made, 80,534 to missing)
(note: file input/UKB_logAUDIT_part1.pheno not found)
file input/UKB_logAUDIT_part1.pheno saved
(311,346 missing values generated)
(104,274 real changes made, 104,274 to missing)
(note: file input/UKB_MYOPIA_part1.pheno not found)
file input/UKB_MYOPIA_part1.pheno saved
(251,763 missing values generated)
(155,520 real changes made, 155,520 to missing)
(note: file input/UKB_MENARCHE_part1.pheno not found)
file input/UKB_MENARCHE_part1.pheno saved
(290,595 missing values generated)
(129,413 real changes made, 129,413 to missing)
(note: file input/UKB_AFB_part1.pheno not found)
file input/UKB_AFB_part1.pheno saved
(284,895 missing values generated)
(136,181 real changes made, 136,181 to missing)
(note: file input/UKB_N_EVERBORN_MEN_part1.pheno not found)
file input/UKB_N_EVERBORN_MEN_part1.pheno saved
(245,567 missing values generated)
(159,962 real changes made, 159,962 to missing)
(note: file input/UKB_N_EVERBORN_WOMEN_part1.pheno not found)
file input/UKB_N_EVERBORN_WOMEN_part1.pheno saved
(139,319 missing values generated)
(231,320 real changes made, 231,320 to missing)
(note: file input/UKB_ALZfather_part1.pheno not found)
file input/UKB_ALZfather_part1.pheno saved
(101,423 missing values generated)
(257,047 real changes made, 257,047 to missing)
(note: file input/UKB_ALZmother_part1.pheno not found)
file input/UKB_ALZmother_part1.pheno saved
(319,096 missing values generated)
(115,346 real changes made, 115,346 to missing)
(note: file input/UKB_FAM_SATISF_part2.pheno not found)
file input/UKB_FAM_SATISF_part2.pheno saved
(319,408 missing values generated)
(115,055 real changes made, 115,055 to missing)
(note: file input/UKB_FRIEND_SATISF_part2.pheno not found)
file input/UKB_FRIEND_SATISF_part2.pheno saved
(372,371 missing values generated)
(78,906 real changes made, 78,906 to missing)
(note: file input/UKB_WORK_SATISF_part2.pheno not found)
file input/UKB_WORK_SATISF_part2.pheno saved
(318,358 missing values generated)
(115,757 real changes made, 115,757 to missing)
(note: file input/UKB_FIN_SATISF_part2.pheno not found)
file input/UKB_FIN_SATISF_part2.pheno saved
(47,884 missing values generated)
(293,078 real changes made, 293,078 to missing)
(note: file input/UKB_LONELY_part2.pheno not found)
file input/UKB_LONELY_part2.pheno saved
(348,249 missing values generated)
(92,320 real changes made, 92,320 to missing)
(note: file input/UKB_CPD_part2.pheno not found)
file input/UKB_CPD_part2.pheno saved
(348,249 missing values generated)
(92,320 real changes made, 92,320 to missing)
(note: file input/UKB_CPDbins_part2.pheno not found)
file input/UKB_CPDbins_part2.pheno saved
(41,446 missing values generated)
(297,311 real changes made, 297,311 to missing)
(note: file input/UKB_COPD_part2.pheno not found)
file input/UKB_COPD_part2.pheno saved
(41,446 missing values generated)
(297,311 real changes made, 297,311 to missing)
(note: file input/UKB_ASTHMA_part2.pheno not found)
file input/UKB_ASTHMA_part2.pheno saved
(77,403 missing values generated)
(273,617 real changes made, 273,617 to missing)
(note: file input/UKB_MIGRAINE_part2.pheno not found)
file input/UKB_MIGRAINE_part2.pheno saved
(41,520 missing values generated)
(297,262 real changes made, 297,262 to missing)
(note: file input/UKB_DEPRESS_part2.pheno not found)
file input/UKB_DEPRESS_part2.pheno saved
(101,855 missing values generated)
(257,578 real changes made, 257,578 to missing)
(note: file input/UKB_DPW_part2.pheno not found)
file input/UKB_DPW_part2.pheno saved
(41,549 missing values generated)
(297,249 real changes made, 297,249 to missing)
(note: file input/UKB_EVERSMOKE_part2.pheno not found)
file input/UKB_EVERSMOKE_part2.pheno saved
(42,355 missing values generated)
(296,738 real changes made, 296,738 to missing)
(note: file input/UKB_HEIGHT_part2.pheno not found)
file input/UKB_HEIGHT_part2.pheno saved
(48,933 missing values generated)
(292,351 real changes made, 292,351 to missing)
(note: file input/UKB_BMI_part2.pheno not found)
file input/UKB_BMI_part2.pheno saved
(125,721 missing values generated)
(241,334 real changes made, 241,334 to missing)
(note: file input/UKB_NEURO_part2.pheno not found)
file input/UKB_NEURO_part2.pheno saved
(86,333 missing values generated)
(267,765 real changes made, 267,765 to missing)
(note: file input/UKB_MORNING_part2.pheno not found)
file input/UKB_MORNING_part2.pheno saved
(42,567 missing values generated)
(296,564 real changes made, 296,564 to missing)
(note: file input/UKB_RELIG_part2.pheno not found)
file input/UKB_RELIG_part2.pheno saved
(318,190 missing values generated)
(115,886 real changes made, 115,886 to missing)
(note: file input/UKB_SWB_part2.pheno not found)
file input/UKB_SWB_part2.pheno saved
(43,023 missing values generated)
(296,278 real changes made, 296,278 to missing)
(note: file input/UKB_HEALTH_part2.pheno not found)
file input/UKB_HEALTH_part2.pheno saved
(47,234 missing values generated)
(293,538 real changes made, 293,538 to missing)
(note: file input/UKB_HAYFVR_part2.pheno not found)
file input/UKB_HAYFVR_part2.pheno saved
(47,234 missing values generated)
(293,538 real changes made, 293,538 to missing)
(note: file input/UKB_ECZEMA_part2.pheno not found)
file input/UKB_ECZEMA_part2.pheno saved
(41,446 missing values generated)
(297,311 real changes made, 297,311 to missing)
(note: file input/UKB_ECZRHI_part2.pheno not found)
file input/UKB_ECZRHI_part2.pheno saved
(41,446 missing values generated)
(297,311 real changes made, 297,311 to missing)
(note: file input/UKB_ASTECZRHI_part2.pheno not found)
file input/UKB_ASTECZRHI_part2.pheno saved
(45,320 missing values generated)
(294,783 real changes made, 294,783 to missing)
(note: file input/UKB_EA_part2.pheno not found)
file input/UKB_EA_part2.pheno saved
(262,353 missing values generated)
(153,372 real changes made, 153,372 to missing)
(note: file input/UKB_IQ_part2.pheno not found)
file input/UKB_IQ_part2.pheno saved
(41,425 missing values generated)
(297,323 real changes made, 297,323 to missing)
(note: file input/UKB_RISK_part2.pheno not found)
file input/UKB_RISK_part2.pheno saved
(343,297 missing values generated)
(100,484 real changes made, 100,484 to missing)
(note: file input/UKB_CANNABIS_part2.pheno not found)
file input/UKB_CANNABIS_part2.pheno saved
(343,297 missing values generated)
(100,484 real changes made, 100,484 to missing)
(note: file input/UKB_EVERCANNABIS_part2.pheno not found)
file input/UKB_EVERCANNABIS_part2.pheno saved
(355,749 missing values generated)
(91,835 real changes made, 91,835 to missing)
(note: file input/UKB_logAUDIT_part2.pheno not found)
file input/UKB_logAUDIT_part2.pheno saved
(311,346 missing values generated)
(124,189 real changes made, 124,189 to missing)
(note: file input/UKB_MYOPIA_part2.pheno not found)
file input/UKB_MYOPIA_part2.pheno saved
(251,763 missing values generated)
(157,884 real changes made, 157,884 to missing)
(note: file input/UKB_MENARCHE_part2.pheno not found)
file input/UKB_MENARCHE_part2.pheno saved
(290,595 missing values generated)
(132,057 real changes made, 132,057 to missing)
(note: file input/UKB_AFB_part2.pheno not found)
file input/UKB_AFB_part2.pheno saved
(284,895 missing values generated)
(134,459 real changes made, 134,459 to missing)
(note: file input/UKB_N_EVERBORN_MEN_part2.pheno not found)
file input/UKB_N_EVERBORN_MEN_part2.pheno saved
(245,567 missing values generated)
(161,851 real changes made, 161,851 to missing)
(note: file input/UKB_N_EVERBORN_WOMEN_part2.pheno not found)
file input/UKB_N_EVERBORN_WOMEN_part2.pheno saved
(139,319 missing values generated)
(232,508 real changes made, 232,508 to missing)
(note: file input/UKB_ALZfather_part2.pheno not found)
file input/UKB_ALZfather_part2.pheno saved
(101,423 missing values generated)
(257,450 real changes made, 257,450 to missing)
(note: file input/UKB_ALZmother_part2.pheno not found)
file input/UKB_ALZmother_part2.pheno saved
(319,096 missing values generated)
(114,723 real changes made, 114,723 to missing)
(note: file input/UKB_FAM_SATISF_part3.pheno not found)
file input/UKB_FAM_SATISF_part3.pheno saved
(319,408 missing values generated)
(114,460 real changes made, 114,460 to missing)
(note: file input/UKB_FRIEND_SATISF_part3.pheno not found)
file input/UKB_FRIEND_SATISF_part3.pheno saved
(372,371 missing values generated)
(78,569 real changes made, 78,569 to missing)
(note: file input/UKB_WORK_SATISF_part3.pheno not found)
file input/UKB_WORK_SATISF_part3.pheno saved
(318,358 missing values generated)
(115,188 real changes made, 115,188 to missing)
(note: file input/UKB_FIN_SATISF_part3.pheno not found)
file input/UKB_FIN_SATISF_part3.pheno saved
(47,884 missing values generated)
(293,164 real changes made, 293,164 to missing)
(note: file input/UKB_LONELY_part3.pheno not found)
file input/UKB_LONELY_part3.pheno saved
(348,249 missing values generated)
(92,930 real changes made, 92,930 to missing)
(note: file input/UKB_CPD_part3.pheno not found)
file input/UKB_CPD_part3.pheno saved
(348,249 missing values generated)
(92,930 real changes made, 92,930 to missing)
(note: file input/UKB_CPDbins_part3.pheno not found)
file input/UKB_CPDbins_part3.pheno saved
(41,446 missing values generated)
(297,305 real changes made, 297,305 to missing)
(note: file input/UKB_COPD_part3.pheno not found)
file input/UKB_COPD_part3.pheno saved
(41,446 missing values generated)
(297,305 real changes made, 297,305 to missing)
(note: file input/UKB_ASTHMA_part3.pheno not found)
file input/UKB_ASTHMA_part3.pheno saved
(77,403 missing values generated)
(273,710 real changes made, 273,710 to missing)
(note: file input/UKB_MIGRAINE_part3.pheno not found)
file input/UKB_MIGRAINE_part3.pheno saved
(41,520 missing values generated)
(297,265 real changes made, 297,265 to missing)
(note: file input/UKB_DEPRESS_part3.pheno not found)
file input/UKB_DEPRESS_part3.pheno saved
(101,855 missing values generated)
(257,452 real changes made, 257,452 to missing)
(note: file input/UKB_DPW_part3.pheno not found)
file input/UKB_DPW_part3.pheno saved
(41,549 missing values generated)
(297,240 real changes made, 297,240 to missing)
(note: file input/UKB_EVERSMOKE_part3.pheno not found)
file input/UKB_EVERSMOKE_part3.pheno saved
(42,355 missing values generated)
(296,746 real changes made, 296,746 to missing)
(note: file input/UKB_HEIGHT_part3.pheno not found)
file input/UKB_HEIGHT_part3.pheno saved
(48,933 missing values generated)
(292,516 real changes made, 292,516 to missing)
(note: file input/UKB_BMI_part3.pheno not found)
file input/UKB_BMI_part3.pheno saved
(125,721 missing values generated)
(241,626 real changes made, 241,626 to missing)
(note: file input/UKB_NEURO_part3.pheno not found)
file input/UKB_NEURO_part3.pheno saved
(86,333 missing values generated)
(267,684 real changes made, 267,684 to missing)
(note: file input/UKB_MORNING_part3.pheno not found)
file input/UKB_MORNING_part3.pheno saved
(42,567 missing values generated)
(296,591 real changes made, 296,591 to missing)
(note: file input/UKB_RELIG_part3.pheno not found)
file input/UKB_RELIG_part3.pheno saved
(318,190 missing values generated)
(115,262 real changes made, 115,262 to missing)
(note: file input/UKB_SWB_part3.pheno not found)
file input/UKB_SWB_part3.pheno saved
(43,023 missing values generated)
(296,303 real changes made, 296,303 to missing)
(note: file input/UKB_HEALTH_part3.pheno not found)
file input/UKB_HEALTH_part3.pheno saved
(47,234 missing values generated)
(293,570 real changes made, 293,570 to missing)
(note: file input/UKB_HAYFVR_part3.pheno not found)
file input/UKB_HAYFVR_part3.pheno saved
(47,234 missing values generated)
(293,570 real changes made, 293,570 to missing)
(note: file input/UKB_ECZEMA_part3.pheno not found)
file input/UKB_ECZEMA_part3.pheno saved
(41,446 missing values generated)
(297,305 real changes made, 297,305 to missing)
(note: file input/UKB_ECZRHI_part3.pheno not found)
file input/UKB_ECZRHI_part3.pheno saved
(41,446 missing values generated)
(297,305 real changes made, 297,305 to missing)
(note: file input/UKB_ASTECZRHI_part3.pheno not found)
file input/UKB_ASTECZRHI_part3.pheno saved
(45,320 missing values generated)
(294,771 real changes made, 294,771 to missing)
(note: file input/UKB_EA_part3.pheno not found)
file input/UKB_EA_part3.pheno saved
(262,353 missing values generated)
(152,295 real changes made, 152,295 to missing)
(note: file input/UKB_IQ_part3.pheno not found)
file input/UKB_IQ_part3.pheno saved
(41,425 missing values generated)
(297,322 real changes made, 297,322 to missing)
(note: file input/UKB_RISK_part3.pheno not found)
file input/UKB_RISK_part3.pheno saved
(343,297 missing values generated)
(99,500 real changes made, 99,500 to missing)
(note: file input/UKB_CANNABIS_part3.pheno not found)
file input/UKB_CANNABIS_part3.pheno saved
(343,297 missing values generated)
(99,500 real changes made, 99,500 to missing)
(note: file input/UKB_EVERCANNABIS_part3.pheno not found)
file input/UKB_EVERCANNABIS_part3.pheno saved
(355,749 missing values generated)
(90,951 real changes made, 90,951 to missing)
(note: file input/UKB_logAUDIT_part3.pheno not found)
file input/UKB_logAUDIT_part3.pheno saved
(311,346 missing values generated)
(123,663 real changes made, 123,663 to missing)
(note: file input/UKB_MYOPIA_part3.pheno not found)
file input/UKB_MYOPIA_part3.pheno saved
(251,763 missing values generated)
(157,888 real changes made, 157,888 to missing)
(note: file input/UKB_MENARCHE_part3.pheno not found)
file input/UKB_MENARCHE_part3.pheno saved
(290,595 missing values generated)
(132,158 real changes made, 132,158 to missing)
(note: file input/UKB_AFB_part3.pheno not found)
file input/UKB_AFB_part3.pheno saved
(284,895 missing values generated)
(134,388 real changes made, 134,388 to missing)
(note: file input/UKB_N_EVERBORN_MEN_part3.pheno not found)
file input/UKB_N_EVERBORN_MEN_part3.pheno saved
(245,567 missing values generated)
(161,871 real changes made, 161,871 to missing)
(note: file input/UKB_N_EVERBORN_WOMEN_part3.pheno not found)
file input/UKB_N_EVERBORN_WOMEN_part3.pheno saved
(139,319 missing values generated)
(232,352 real changes made, 232,352 to missing)
(note: file input/UKB_ALZfather_part3.pheno not found)
file input/UKB_ALZfather_part3.pheno saved
(101,423 missing values generated)
(257,475 real changes made, 257,475 to missing)
(note: file input/UKB_ALZmother_part3.pheno not found)
file input/UKB_ALZmother_part3.pheno saved

. 
. 
. *** END ***
. log close
      name:  <unnamed>
       log:  /disk/genetics4/PGS/Aysu/PGS_Repo_pipeline/code/1_UKB_GWAS/1.1_pre
> p_UKB_phenos.do.log
  log type:  text
 closed on:   1 May 2020, 15:56:33
-------------------------------------------------------------------------------

. 
end of do-file
